tap "homebrew/autoupdate"
tap "homebrew/services"

brew "uv"
brew "python@3.13"
brew "node"
brew "pnpm"
brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "gemini-cli"
brew "gh"
brew "neovim"
brew "stow"
brew "starship"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-monaspace"
cask "ghostty"

cask "github"
cask "obsidian"
cask "warp"
brew "curlie"
